app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("updated_at", "title", "content", "created_at") VALUES('2009-03-13 06:55:56', 'fweawef', 'There are several ways to make a footer stick to the bottom of a page using CSS. But until now, they''ve used long and messy hacks or a lot of extra HTML markup; this method uses only 15 lines of CSS and hardly any HTML markup. Even better, it''s completely valid CSS, and it works in all major browsers. Internet Explorer 5 and up, Firefox, Safari, Opera and more.

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "content" = 'This is the very first post! We''re editing stuff!', "updated_at" = '2009-03-13 05:07:03' WHERE "id" = 1

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
DELETE FROM "posts" WHERE "id" = 1