app/controllers/welcome_controller.rb

  def index
    @posts = Post.paginate :page => params[:page], :order => 'created_at DESC', :per_page => 10
---
SELECT * FROM "posts" ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "posts"